-- FileName:   test_data.sql
-- Author:     Chen Yanfei
-- @contact:   fasionchan@gmail.com
-- @version:   $Id$
--
-- Description:
--
-- Changelog:
--
--

INSERT INTO `food_material` 
    (`name`, `hash`, `category`, `alias`, `image_hash`, `amount_rec`,
        `suit_crowds`, `avoid_crowds`, `suit_ctcms`, `avoid_ctcms`,
        `brief`, `nutrient`, `efficacy`, `taboos`, `suit_mix`, `avoid_mix`,
        `choose`, `store`, `tips`) VALUES
    ("葡萄", "f87d4aa1983b42bfa13be0f49d1fa2db", "水果",
        "草龙珠,山葫芦,蒲桃,菩提子", "", "每天约100克",
        "一般人群均可食用", "糖尿病慎食", "平和质",
        "气虚质,阳虚质,阴虚质", "在西方古老的传说中，葡萄果实是由乐善好施的神Osiris把它带到人间来的，葡萄酒“Vin”一词，其实就是人们心中“神”的另一种说法。葡萄属落叶藤本植物，葡萄科Vita-ceae植物葡萄Vitis Vinifera LINN的果实，是地球上最古老的植物之一，也是人类最早栽培的果树之一。大约在100万年以前，葡萄树就在地中海沿岸自然地生长着，法国南部阳光充沛的普罗旺斯地区就是葡萄的起源地，并从这里开始向东西方传播。在美洲新大陆，葡萄是由最早的殖民者传入的，尔后深入到美国东部各洲。后来，亚历山大东征把希腊文明带入中亚，从此种植葡萄、酿葡萄酒和对酒神崇拜，开始在粟特人中广为流传。在中国，葡萄是由汉朝张骞在公元前138年出使西域时从波斯引进的，后来经丝绸之路把这个绿色使者引向了不毛之地的戈壁。如今在全世界的果品生产中，葡萄的产量及栽培面积一直居于首位，成为人们心中真正的“水果之神”。\n世界各地生产的葡萄有上千种，总体上可以分为酿酒葡萄和食用葡萄两大类。酿酒葡萄可以分为酿造白葡萄酒、酿造红葡萄酒和调色调香三大品种，这些葡萄的主要产区分布在法国南部、意大利东部、美国加洲和南美洲各国。食用葡萄的品种更加繁多，市场上常见的巨峰、龙眼、玫瑰香等品种都是物美价廉的食用葡萄，而闻名中外的我国新疆马奶葡萄、河北白牛奶葡萄、山东龙眼葡萄以及四川的绿葡萄则都是口感甘甜、营养丰富的葡萄佳品。一般来说，食用葡萄生长地区的日照越充足、气候越干燥、早晚温差越大，则果实越饱满、口味越浓郁、营养价值越高。葡萄与提子实质上都是葡萄的果实。“提子”是香港、等地对葡萄的别称。",
        "nutrient", "efficacy", "taboos", "suit_mix", "avoid_mix", "choose",
        "store", "tips");
